arvi-kris-cy/smartlock_psoc4-4000t_develop/source/cy_capsense_sensing_v3.c
    return (capStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSlots
****************************************************************************//**
*
* Initiates the non-blocking scan of specified slots. Scanning is
* initiated only if no scan is in progress. Scan finishing can be
* checked by the Cy_CapSense_IsBusy() function.
*
* This function initiates a scan only for the first specified slot for all channels
* and then exits. Scans for the remaining slots in the interrupt-driven scan mode
* are initiated
* in the interrupt service routine (part of middleware) triggered at the end
* of each scan completion for each channel. If the syncMode field in the
* cy_stc_capsense_common_config_t structure is set to CY_CAPSENSE_SYNC_MODE_OFF,
* then the next slot scan for the channel with the fired interrupt,
* will start regardless of the another channel readiness for the next scan.
* If the syncMode field is set to CY_CAPSENSE_SYNC_INTERNAL (for single-chip projects)
* or to CY_CAPSENSE_SYNC_EXTERNAL (for multi-chip projects),
* then the next slot scan for the channel with the fired interrupt,
* will start in lockstep with another channels after they all are ready
* for the next scan.
* The scan for the remaining slots in CS-DMA scan mode are initiated
* by DMAC triggered at the end
* of each scan completion for each channel. The channel scan synchronization is
* performed as in Interrupt-driven scan mode. After all slots are scanned,
* the FRAME interrupt is fired and the interrupt service routine (part of middleware)
* updates the busy status.
* To decrease the start scan time when it is intended to scan the same slot,
* i.e. the startSlotId parameter is the same and numberSlots = 1u, then the scan
* is performed without the MSC HW block reconfiguration. Also, in the AMUX mode
* sensors are not disconnected.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param startSlotId
* The slot ID scan will be started from.
*
* \param numberSlots
* The number of slots will be scanned.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_HW_BUSY          - The HW is busy with the previous scan.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSlots(
                uint32_t startSlotId,
                uint32_t numberSlots,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    uint32_t curChIndex;
    uint32_t lastSlot = startSlotId + numberSlots - 1u;
    const cy_stc_capsense_common_config_t * ptrCommonCfg;
    cy_stc_capsense_internal_context_t * ptrIntrCxt;
    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
        uint32_t wdIndex;
        uint32_t snsIndex;
        uint32_t slotValue;
        uint32_t curSlotIndex;
        uint32_t scanSlotIndexValid;
    #endif

    #if((CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) || \
        (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD))
        uint32_t * ptrSensorFrame;
    #endif

    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
        uint32_t sensorFrame[CY_MSC_6_SNS_REGS] = {0u, 0u, 0u, 0u, 0u, 0u};
    #endif

    if ((NULL != context) && (0u != numberSlots))
    {
        if (CY_CAPSENSE_SLOT_COUNT > lastSlot)
        {
            ptrIntrCxt = context->ptrInternalContext;
            ptrCommonCfg = context->ptrCommonConfig;

            if (CY_CAPSENSE_NOT_BUSY != Cy_CapSense_IsBusy(context))
            {
                /* Previous widget is being scanned. Return error. */
                capStatus = CY_CAPSENSE_STATUS_HW_BUSY;
            }
            else
            {
                if ((CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING == ptrIntrCxt->hwConfigState) &&
                    (ptrIntrCxt->currentSlotIndex == startSlotId) && (1u == numberSlots) &&
                    (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_CALIBRATION_MASK)) &&
                    (ptrIntrCxt->scanSingleSlot == CY_CAPSENSE_SCAN_SNGL_SLOT))
                {
                    #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        /* Initiates the frame start for each channel in interrupt driven scan mode */
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                          ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->FRAME_CMD =
                              MSC_FRAME_CMD_START_FRAME_Msk;
                        }
                    #endif /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

                    /* Initialize all enabled MSC channels for scan */
                    for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                    {
                        Cy_CapSense_SetBusyFlags(curChIndex, context);

                        if (NULL != ptrIntrCxt->ptrSSCallback)
                        {
                          ptrIntrCxt->ptrSSCallback((cy_stc_active_scan_sns_t *)&context->ptrActiveScanSns[curChIndex]);
                        }

                        #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->SNS_CTL = context->ptrInternalContext->snsCtlReg[curChIndex] |
                                    (MSC_SNS_CTL_START_SCAN_Msk | MSC_SNS_CTL_LAST_Msk);
                        #endif

                        #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            context->ptrSensorFrameContext[((lastSlot + 1u +
                                (curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT) *
                                    CY_MSC_6_SNS_REGS) - 1u] |= MSC_SNS_CTL_LAST_Msk;
                        #endif
                    }

                    #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                        /* Initiates the frame start for each channel in DMA driven scan mode */
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                          ptrCommonCfg->ptrMscChConfig[curChIndex].ptrMscBase->FRAME_CMD =
                              MSC_FRAME_CMD_START_FRAME_Msk;
                        }
                    #endif
					
					capStatus = CY_CAPSENSE_STATUS_SUCCESS;
                }
                else
                {
                    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            if (CY_CAPSENSE_SNS_CONNECTED == context->ptrActiveScanSns[curChIndex].connectedSnsState)
                            {
                                /* Disconnect the scanned sensor */
                                Cy_CapSense_DisconnectSensor(curChIndex, context);
                            }
                        }
                    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

                    capStatus = Cy_CapSense_SwitchHwConfiguration(CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING, context);
                    if (CY_CAPSENSE_STATUS_SUCCESS == capStatus)
                    {

                        for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                        {
                            context->ptrActiveScanSns[curChIndex].currentChannelSlotIndex = (uint16_t)startSlotId;
                        }

                        #if (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE)
                            if((ptrIntrCxt->currentSlotIndex != (uint16_t)startSlotId) ||
                               (ptrIntrCxt->endSlotIndex != (uint16_t)lastSlot))
                            {
                                ptrIntrCxt->currentSlotIndex = (uint16_t)startSlotId;
                                ptrIntrCxt->endSlotIndex = (uint16_t)lastSlot;
                                /* Configure DMA resources for each channel */
                                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                                {
                                    (void)Cy_CapSense_ConfigureDmaResource(curChIndex, context);
                                }
                            }
                        #else /* (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE) */

