arvi-kris-cy/smartlock_psoc4-4000t_develop/source/cy_capsense_sensing_v3.c
            /* Finds max RefCDAC and normalizes RefCDAC */
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_REF_AUTO_USAGE)
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                    {
                        /* Normalize widgets for which CompCDAC */
                        calibStatus |= Cy_CapSense_NormalizeCdac(curWdIndex, context);
                    }
                }
            #endif
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_REF_AUTO_USAGE)
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                    {
                        /* Normalize widgets for which CompCDAC */
                        calibStatus |= Cy_CapSense_NormalizeCdac(curWdIndex, context);
                    }
                }
            #endif
            context->ptrCommonContext->status &= (uint32_t)~((uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK);
        #endif

        /* Skip rest of the stages for SmartSense as not needed */
        if (0u == (context->ptrCommonContext->status & CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK))
        {
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) || \
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
                    /* Find CompDivider with fixed Ref CDAC and maximum CompCDAC (for case #8 or #4) */
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_DIV_AUTO_USAGE)
                    for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                    {
                        if (CY_CAPSENSE_CSD_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                        {
                            calibStatus |= Cy_CapSense_CalibrateCompDivider(curWdIndex, context);
                        }
                    }
                #endif
                #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_DIV_AUTO_USAGE)
                    for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                    {
                        if (CY_CAPSENSE_CSX_GROUP == context->ptrWdConfig[curWdIndex].senseMethod)
                        {
                            calibStatus |= Cy_CapSense_CalibrateCompDivider(curWdIndex, context);
                        }
                    }
                #endif

                /* Calibrate CompCDAC with fixed Ref CDAC and fixed CompDivider (case #3, #4, #7, #8) */
                if (CY_CAPSENSE_STATUS_SUCCESS == calibStatus)
                {
                    for (curSlotIndex = 0u; curSlotIndex < CY_CAPSENSE_SLOT_COUNT; curSlotIndex++)
                    {
                        /* Calibrate all sensors in slot */
                        calibStatus |= Cy_CapSense_CalibrateSlot(curSlotIndex,
                              CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR, context);
                    }
                }
            #endif

            /* Check calibration result */
            if (CY_CAPSENSE_STATUS_SUCCESS == calibStatus)
            {
                for (curWdIndex = 0u; curWdIndex < ptrCommonCfg->numWd; curWdIndex++)
                {
                    calibStatus |= Cy_CapSense_VerifyCalibration(curWdIndex, context);
                }
            }

            /* Update CRC if BIST is enabled */
            #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                 (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_WDGT_CRC_EN))
                Cy_CapSense_UpdateAllWidgetCrc(context);
            #endif
        }

        if (CY_CAPSENSE_STATUS_SUCCESS != calibStatus)
        {
            calibStatus |= CY_CAPSENSE_STATUS_CALIBRATION_FAIL;
        }

        context->ptrCommonContext->status &= ~(uint32_t)CY_CAPSENSE_MW_STATE_CALIBRATION_MASK;
    }

    return (calibStatus);
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_SetCalibrationTargets
****************************************************************************//**
*
* Sets the CapDAC auto-calibration raw count targets for CSD and/or CSX widgets.
*
* The function sets the specified raw count targets if CSD and/or CSX widgets are
* in the project and the auto-calibration is enabled for them. These targets will
* be used instead the configured ones by Cy_CapSense_CalibrateAllSlots(),
* Cy_CapSense_CalibrateAllWidgets() and Cy_CapSense_CalibrateWidget() functions.
*
* \note
* This function is available only for the fifth-generation CAPSENSE&trade;.
*
* \param csdCalibrTarget
* The specified raw counts target for CSD widgets in percentage. It should be
* more than 0u and less than 100u. If the specified target is outside the range,
* then the configured target value will be used for the auto-calibration.
*
* \param csxCalibrTarget
* The specified raw counts target for CSX widgets in percentage. It should be
* more than 0u and less than 100u. If the specified target is outside the range,
* then the configured target value will be used for the auto-calibration.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS          - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM        - At least one of the input parameter is
*                                         invalid.
* - CY_CAPSENSE_STATUS_BAD_CONFIG       - The configuration parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_SetCalibrationTargets(
                uint32_t csdCalibrTarget,
                uint32_t csxCalibrTarget,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_BAD_PARAM;

    if (NULL != context)
    {
        if ((CY_CAPSENSE_PERCENTAGE_100 > csdCalibrTarget) &&
            (CY_CAPSENSE_PERCENTAGE_100 > csxCalibrTarget) &&
            (0u < csdCalibrTarget) && (0u < csxCalibrTarget))
        {
            #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN)
                context->ptrInternalContext->intrCsdRawTarget = (uint8_t)csdCalibrTarget;
            #endif

            #if(CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)
                context->ptrInternalContext->intrCsxRawTarget = (uint8_t)csxCalibrTarget;
            #endif
            calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
        }
    }

    return (calibStatus);
}
#endif


