arvi-kris-cy/smartlock_psoc4-4000t_develop/source/cy_capsense_sensing_v3.c
    if (curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER)
    {
        /* Clear all pending interrupts of the MSC HW block */
        ptrMscHwBase->INTR = CY_CAPSENSE_MSC_INTR_ALL_MSK;
        (void)ptrMscHwBase->INTR;

        #if (CY_CAPSENSE_SCAN_MODE_INT_DRIVEN == CY_CAPSENSE_SCAN_MODE)
            slotStcIndex = ((curChIndex + ptrCommonCfg->channelOffset) * CY_CAPSENSE_SLOT_COUNT) + ptrIntrCxt->currentSlotIndex;
            /* Set the active scan pointer to the current channel */
            ptrActive = &(cxt->ptrActiveScanSns[curChIndex]);

            slotValue = cxt->ptrScanSlots[slotStcIndex].wdId;
            if(CY_CAPSENSE_SLOT_SHIELD_ONLY > slotValue)
            {
                /* Read raw counts */
                tmpRawCount = ptrMscHwBase->RESULT_FIFO_RD;
                ptrActive->ptrSnsContext->status &= (uint8_t)~CY_CAPSENSE_SNS_OVERFLOW_MASK;
                if (MSC_RESULT_FIFO_RD_OVERFLOW_Msk == (tmpRawCount & MSC_RESULT_FIFO_RD_OVERFLOW_Msk))
                {
                    ptrActive->ptrSnsContext->status |= CY_CAPSENSE_SNS_OVERFLOW_MASK;
                }
                tmpRawCount &= MSC_RESULT_FIFO_RD_RAW_COUNT_Msk;
                ptrActive->ptrSnsContext->raw = (uint16_t)tmpRawCount;
            }
            else
            {
                (void)ptrMscHwBase->RESULT_FIFO_RD;
            }

            /* Stores non-retention SNS_CTL register value for LFT mode */
            cxt->ptrInternalContext->snsCtlReg[curChIndex] = ptrMscHwBase->SNS_CTL;

            #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                if ((CY_CAPSENSE_SCAN_MULTIPLE_SLOT == cxt->ptrInternalContext->scanSingleSlot) &&
                    (CY_CAPSENSE_SLOT_SHIELD_ONLY != slotValue) &&
                    (CY_CAPSENSE_SLOT_EMPTY != slotValue))
                {
                    /* Disconnect the scanned sensor */
                    Cy_CapSense_DisconnectSensor(curChIndex, cxt);
                }
            #endif

            /* Check for the last slot with multiple slot scan, if not - start the next slot scan */
            if (ptrIntrCxt->currentSlotIndex != ptrIntrCxt->endSlotIndex)
            {
                /* Update active sensor structure */
                ptrActive->currentChannelSlotIndex = ptrIntrCxt->currentSlotIndex + 1u;
                slotStcIndex++;
                slotValue = cxt->ptrScanSlots[slotStcIndex].wdId;

                scanSlotIndexValid = slotStcIndex;
                if(CY_CAPSENSE_SLOT_EMPTY == slotValue)
                {
                    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
                        if(slotStcIndex < CY_CAPSENSE_SLOT_COUNT)
                        {
                            scanSlotIndexValid += CY_CAPSENSE_SLOT_COUNT;
                        }
                        else
                        {
                            scanSlotIndexValid -= CY_CAPSENSE_SLOT_COUNT;
                        }
                    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */
                }
                else if (CY_CAPSENSE_SLOT_SHIELD_ONLY <= slotValue)
                {
                    scanSlotIndexValid = ((uint32_t)cxt->ptrScanSlots[slotStcIndex].snsId * CY_CAPSENSE_SLOT_COUNT) +
                                (slotStcIndex % CY_CAPSENSE_SLOT_COUNT);
                }
                else
                {
                    /* Do nothing */
                }

                /* Initialize next slot scan for the current channel */
                wdIndex = cxt->ptrScanSlots[scanSlotIndexValid].wdId;
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    prevWdIndex = ptrActive->widgetIndex;
                    Cy_CapSense_ConfigureAnalogMuxResource(curChIndex, cxt->ptrWdConfig[wdIndex].senseMethod, cxt);
                #endif
                Cy_CapSense_InitActivePtr(curChIndex, wdIndex,
                            cxt->ptrScanSlots[scanSlotIndexValid].snsId, cxt);
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    if((slotValue != CY_CAPSENSE_SLOT_EMPTY) &&
                       (slotValue != CY_CAPSENSE_SLOT_SHIELD_ONLY))
                    {
                        /* Connect the widget first sensor electrodes */
                        Cy_CapSense_ConnectSensor(curChIndex, cxt);
                    }

                    /* Getting the sensor frame configuration */
                    Cy_CapSense_AmuxUpdateScanConfig(curChIndex, slotStcIndex, prevWdIndex, cxt);
                #else
                    ptrSensorFrame = &cxt->ptrSensorFrameContext[(((curChIndex * CY_CAPSENSE_SLOT_COUNT) +
                            ptrActive->currentChannelSlotIndex) * CY_MSC_6_SNS_REGS)];
                #endif

                #if (1u == CY_CAPSENSE_TOTAL_CH_NUMBER)
                    ptrIntrCxt->currentSlotIndex++;
                #else
                    for (i = 1u; i < CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
                    {
                        if (cxt->ptrActiveScanSns[0u].currentChannelSlotIndex != cxt->ptrActiveScanSns[i].currentChannelSlotIndex)
                        {
                            break;
                        }
                        ptrIntrCxt->currentSlotIndex++;
                    }
                #endif /* (1u == CY_CAPSENSE_TOTAL_CH_NUMBER) */

                if (NULL != ptrIntrCxt->ptrSSCallback)
                {
                    ptrIntrCxt->ptrSSCallback((cy_stc_active_scan_sns_t *)&cxt->ptrActiveScanSns[curChIndex]);
                }

                /* Start the next scan for the current channel */
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
                    Cy_CapSense_AmuxStartScan(ptrMscHwBase);
                #else
                    Cy_MSC_ConfigureScan(ptrMscHwBase, CY_MSC_6_SNS_REGS, ptrSensorFrame);
                #endif
            }
            else
            {
                Cy_CapSense_ClrBusyFlags(curChIndex, cxt);
            }
        #else /* (CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN == CY_CAPSENSE_SCAN_MODE) */
            /* The WHOLE FRAME scan is finished for the current channel */
            Cy_CapSense_ClrBusyFlags(curChIndex, cxt);
        #endif
    }
}


#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD)
#if((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CDAC_COMP_USAGE) ||\
    (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CDAC_COMP_USAGE))
/*******************************************************************************
* Function Name: Cy_CapSense_AmuxUpdateCdacComp
****************************************************************************//**
*
* Updates the Compensation CDAC with the configuration of the specified sensor.
*
* \param base
* Pointer to a MSC HW block base address.
*
* \param ptrSnsContext
* Specifies the pointer to a sensor context structure.
*
*******************************************************************************/
void Cy_CapSense_AmuxUpdateCdacComp(
                MSC_Type * base,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext)
{
    uint32_t tmpRegVal;

    tmpRegVal = base->SNS_CDAC_CTL;
    tmpRegVal &= ~MSC_SNS_CDAC_CTL_SEL_CO_Msk;
    tmpRegVal |= ((uint32_t)ptrSnsContext->cdacComp) << MSC_SNS_CDAC_CTL_SEL_CO_Pos;
    base->SNS_CDAC_CTL = tmpRegVal;
}
#endif


