arvi-kris-cy/smartlock_psoc4-4000t_develop/source/cy_capsense_sensing_v3.c
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        ptrSnsFrmCxt = &context->ptrSensorFrameContext[CY_CAPSENSE_SNS_CDAC_CTL_INDEX];
        for (i = 0u; i < CY_CAPSENSE_SLOT_COUNT * CY_CAPSENSE_TOTAL_CH_NUMBER; i++)
        {
            if (widgetId == context->ptrScanSlots[i].wdId)
            {
                cdacTmp = ptrWdCfg->ptrWdContext->cdacRef;
                if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
                    (ptrWdCfg->numCols <= context->ptrScanSlots[i].snsId))
                {
                    cdacTmp = ptrWdCfg->ptrWdContext->rowCdacRef;
                }
                *ptrSnsFrmCxt &= (uint32_t)~(MSC_SNS_CDAC_CTL_SEL_RE_Msk | MSC_SNS_CDAC_CTL_SEL_CO_Msk);
                *ptrSnsFrmCxt |= (uint32_t)(cdacTmp << MSC_SNS_CDAC_CTL_SEL_RE_Pos);
            }
            ptrSnsFrmCxt = &ptrSnsFrmCxt[CY_MSC_6_SNS_REGS];
        }
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

    return (CY_CAPSENSE_STATUS_SUCCESS);
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCompDivider
****************************************************************************//**
*
* This function adjusts the compensation CDAC divider for the specified widget.
*
* The function scans all widget sensors with fixed reference CDAC and maximum
* compensation CDAC values starting from the compensation CDAC divider value
* equal to the snsClk divider (Kcomp = snsClkDiv / CompDiv = 1). If raw counts
* are over the raw target, the function decreases compensation CDAC divider
* value providing Kcomp as integer until raw counts are less than the raw
* target.
*
* The function does not consider multi-frequency feature. I.e. only the first
* (base) frequency channel is used.
*
* \param widgetId
* Specifies the desired widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*                                      The compensation CDAC divider is adjusted
*                                      for the specified widget.
* - CY_CAPSENSE_STATUS_CALIBRATION_FAIL - The compensation CDAC divider can not be
*                                         adjusted for the specified widget.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - Invalid parameter(s).
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;

    uint32_t curChIndex;
    uint32_t curSlotIndex;
    uint32_t skipSlotFlag;
    uint32_t snsOverflow = 0u;
    uint32_t snsIndex;
    uint32_t rawTemp;
    uint32_t target;
    uint32_t j;
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t dummyScanFlagEn = 1u;
    #endif

    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    uint32_t compDivDefault = ptrWdCfg->ptrWdContext->snsClk;

    /* Sets Max CompCDAC Code within specified widget */
    for (j = 0u; j < ptrWdCfg->numSns; j++)
    {
        ptrWdCfg->ptrSnsContext[j].cdacComp = CY_CAPSENSE_CDAC_MAX_CODE;
    }
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
        Cy_CapSense_SetMaxCompCdac(widgetId, context);
    #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

    /* Defines initial value for Compensation Divider including rows and cols */
    #if((CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_MATRIX_EN) ||\
        (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CSD_TOUCHPAD_EN))
        if ((CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod) &&
            (((uint8_t)CY_CAPSENSE_WD_MATRIX_BUTTON_E == ptrWdCfg->wdType) ||
             ((uint8_t)CY_CAPSENSE_WD_TOUCHPAD_E == ptrWdCfg->wdType)))
        {
            if (compDivDefault > ptrWdCfg->ptrWdContext->rowSnsClk)
            {
                compDivDefault = ptrWdCfg->ptrWdContext->rowSnsClk;
            }
        }
        else
        {
            /* Initializes unused rowSnsClk for further optimization */
            ptrWdCfg->ptrWdContext->rowSnsClk = ptrWdCfg->ptrWdContext->snsClk;
        }
    #else
        /* Initializes unused rowSnsClk for further optimization */
        ptrWdCfg->ptrWdContext->rowSnsClk = ptrWdCfg->ptrWdContext->snsClk;
    #endif

    target = context->ptrInternalContext->intrCsdRawTarget;
    if(CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod)
    {
        target = context->ptrInternalContext->intrCsxRawTarget;
    }
    /* Recalculate maxRawCount accordingly to frequency channel */
    target = (target * ptrWdCfg->ptrWdContext->maxRawCount) / CY_CAPSENSE_PERCENTAGE_100;

    compDivDefault++;

    /*
     * Loop through all Compensation Divider values in descending order.
     *
     * Loop ends when CompDiv value equal 1 or Calibration fails.
     * Switches to the next iteration is done when kComp is not an integer
     * or calibration overflows.
     */
    do
    {
        /* Switches to the next possible divider */
        compDivDefault--;
        /* Checks if divider is valid */
        if (((ptrWdCfg->ptrWdContext->snsClk % compDivDefault) != 0u) ||
            ((ptrWdCfg->ptrWdContext->rowSnsClk % compDivDefault) != 0u))
        {
            continue;
        }

        ptrWdCfg->ptrWdContext->cdacCompDivider = (uint16_t)compDivDefault;
        #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
            Cy_CapSense_SetCompDivider(widgetId, context);
        #endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) */

        snsOverflow = 0u;
        for (curSlotIndex = 0u; curSlotIndex < CY_CAPSENSE_SLOT_COUNT; curSlotIndex++)
        {
            skipSlotFlag = 1u;
            for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
            {
                /* Skip slots without specified widget ID */
                if (widgetId == context->ptrScanSlots[curSlotIndex + (curChIndex * CY_CAPSENSE_SLOT_COUNT)].wdId)
                {
                    skipSlotFlag = 0u;
                    break;
                }
            }

            if (0u == skipSlotFlag)
            {
                /* CTRL_MUX + CSX */
                #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                    /* Dummy scan */
                    if ((0u != dummyScanFlagEn) && (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod))
                    {
                        calibStatus |= Cy_CapSense_ScanSlots(curSlotIndex, 1u, context);
                        calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);
                        dummyScanFlagEn = 0u;
                    }
                #endif
                calibStatus |= Cy_CapSense_ScanSlots(curSlotIndex, 1u, context);
                calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);

                /* Checks only the specified widget in the current slot */
                for (curChIndex = 0u; curChIndex < CY_CAPSENSE_TOTAL_CH_NUMBER; curChIndex++)
                {
                    if (widgetId == context->ptrScanSlots[curSlotIndex + (curChIndex * CY_CAPSENSE_SLOT_COUNT)].wdId)
                    {
                        snsIndex = context->ptrScanSlots[curSlotIndex + (curChIndex * CY_CAPSENSE_SLOT_COUNT)].snsId;

                        Cy_CapSense_PreProcessSensor(widgetId, snsIndex, context);

                        rawTemp = ptrWdCfg->ptrSnsContext[snsIndex].raw;

                        if(CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
                        {
                            if (rawTemp > target)
                            {
                                snsOverflow = 1u;
                            }
                        }
                        else
                        {
                            if (rawTemp <= target)
                            {
                                snsOverflow = 1u;
                            }
                        }
                    }
                }
                if (0u != snsOverflow)
                {
                    /* If at least one sensor of the specified widget has
                     * Raw Count too high (no enough compensation level)
                     * then switch to the next compensation divider value.
                     */
                    break;
                }
            }
        }
        /* Finish the searching if no overflow across all sensors of the specified widget */
        if (0u == snsOverflow)
        {
            break;
        }
    } while ((compDivDefault > 1u) && (CY_CAPSENSE_STATUS_SUCCESS == calibStatus));

    return (calibStatus);
}
#endif


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_VerifyCalibration
****************************************************************************//**
*
* Verifies that the calibrated widgets meets the configured conditions.
*
* This function checks whether raw count of each sensor of the specified widgets
* is within the raw count range defined by raw count target and +/- calibration
* error.
*
* \param widgetId
* Specifies the desired widget ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_VerifyCalibration(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    uint32_t snsIndex;
    uint32_t temp;
    uint32_t lowerLimit;
    uint32_t upperLimit;
    uint32_t target;
    uint32_t calibrationError;
    cy_capsense_status_t calibStatus = CY_CAPSENSE_STATUS_SUCCESS;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt = ptrWdCfg->ptrSnsContext;

    /* CTRL_MUX + CSX */
    #if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD) && (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
        uint32_t dummyScanFlagEn = 1u;
        /* Dummy scan */
        if ((0u != dummyScanFlagEn) && (CY_CAPSENSE_CSX_GROUP == ptrWdCfg->senseMethod))
        {
            calibStatus |= Cy_CapSense_ScanSlots(ptrWdCfg->firstSlotId, 1u, context);
            calibStatus |= Cy_CapSense_WaitEndScan(CY_CAPSENSE_CALIBRATION_TIMEOUT, context);
            dummyScanFlagEn = 0u;
        }
    #endif

