arvi-kris-cy/smartlock_psoc4-4000t_develop/source/cy_capsense_sensing_v3.c
        mscBase->SCAN_CTL2 &= (uint32_t)~((uint32_t)MSC_SCAN_CTL2_NUM_EPI_CYCLES_Msk);
        mscBase->SCAN_CTL2 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_SCAN_CTL2_NUM_EPI_CYCLES_Pos);

        mscBase->INIT_CTL4 &= (uint32_t)~((uint32_t)MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Msk);
        mscBase->INIT_CTL4 |= (uint32_t)((uint32_t)CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK <<
                                                   MSC_INIT_CTL4_NUM_PRO_WAIT_CYCLES_Pos);
    }

    /* Step #4: Execute 8-step calibration scan in single RefCDAC mode */
    (void)Cy_CapSense_CalibrateAllSlots(context);

    /* Step #5: Within each widget find a sensor with max Cp / raw count */
    autoTuneConfig.modClock = ptrCommonCfg->periClkHz / ptrCommonCxt->modClk;
    autoTuneConfig.snsResistance = ptrCommonCfg->csdRConst;
    autoTuneConfig.correctionCoeff = CY_CAPSENSE_SENSOR_CONNECTION_MODE;

    ptrWdCfg = context->ptrWdConfig;
    for (i = 0u; i < ptrCommonCfg->numWd; i++)
    {
        if (CY_CAPSENSE_CSD_GROUP == ptrWdCfg->senseMethod)
        {
            ptrWdCxt = ptrWdCfg->ptrWdContext;
            autoTuneConfig.kRef0 = ptrWdCxt->snsClk;
            autoTuneConfig.nSub0 = ptrWdCxt->numSubConversions;
            autoTuneConfig.refCdac = ptrWdCxt->cdacRef;
            autoTuneConfig.fingerCap = ptrWdCxt->fingerCap;

            rawCountMax = 0u;
            for (j = 0u; j < ptrWdCfg->numSns; j++)
            {
                if (rawCountMax < ptrWdCfg->ptrSnsContext[j].raw)
                {
                    rawCountMax = ptrWdCfg->ptrSnsContext[j].raw;
                }
            }

            /* Step #6: Calculates capacitance, clock divider and number of sub-conversions */
            autoTuneConfig.raw = (uint16_t)rawCountMax;
            (void)Cy_CapSense_GetSmartSenseCapacitance(&autoTuneConfig);
            autoTuneConfig.snsCapacitance /= ptrWdCfg->numChopCycles;
            (void)Cy_CapSense_GetSmartSenseFrequencyDivider(&autoTuneConfig);
            (void)Cy_CapSense_GetSmartSenseNumSubconversions(&autoTuneConfig);
            ptrWdCxt->numSubConversions = autoTuneConfig.nSub1 / ptrWdCfg->numChopCycles;
            /* Perform adjusting of sense clock divider mainly for high Cp */
            autoTuneConfig.kRef1 = (autoTuneConfig.kRef1 * CY_CAPSENSE_SMARTSENSE_SCALING_DECI_VAL) /
                    CY_CAPSENSE_SMARTSENSE_CORRECTION;
            autoTuneConfig.kRef1 = (autoTuneConfig.kRef1 + CY_CAPSENSE_SMARTSENSE_ROUND_UP_2_BITS_MASK) &
                    (uint32_t)~CY_CAPSENSE_SMARTSENSE_ROUND_UP_2_BITS_MASK;
            if (CY_CAPSENSE_SMARTSENSE_MAX_KREF_VAL < autoTuneConfig.kRef1)
            {
                autoTuneConfig.kRef1 = CY_CAPSENSE_SMARTSENSE_MAX_KREF_VAL;
            }

            ptrWdCxt->snsClk = autoTuneConfig.kRef1;
            ptrWdCxt->rowSnsClk = autoTuneConfig.kRef1;
            ptrWdCxt->sigPFC = autoTuneConfig.sigPFC;
        }
        ptrWdCfg++;
    }

    /* Step #6.b: Align SnsClkDiv and Nsub for multi-channel solution */
    #if (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u)
        /* Implemented faster algorithm to align frequency across all slots */
        ptrWdCfg = context->ptrWdConfig;
        /* Reset the widget group to initial state, no widgets in group */
        wdIdMask = 0u;
        maxDivider = 1u;
        maxSubconversions = 1u;
        /* A single loop through all slots */
        for (i = 0u; i < CY_CAPSENSE_SLOT_COUNT; i++)
        {
            /* Save widget IDs for the current slot */
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                wdIndex[j] = context->ptrScanSlots[i + (j * CY_CAPSENSE_SLOT_COUNT)].wdId;
            }

            /* If CSX then, update the current group, reset the widget group and switch to the next slot */
            loopFlag = 0u;
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_SLOT_SHIELD_ONLY)
                {
                    if (CY_CAPSENSE_CSX_GROUP == ptrWdCfg[wdIndex[j]].senseMethod)
                    {
                        /* Updates the current group */
                        Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
                        /* Reset the widget group to initial state, no widgets in group */
                        wdIdMask = 0u;
                        maxDivider = 1u;
                        maxSubconversions = 1u;
                        /* Sets a flag to switch to the new slot */
                        loopFlag = 1u;
                        break;
                    }
                }
            }
            if (0u != loopFlag)
            {
                continue;
            }

            /* Check if new slot has overlapping with widget group */
            loopFlag = 0u;
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_SLOT_SHIELD_ONLY)
                {
                    if (0u != (wdIdMask & (1uLL << wdIndex[j])))
                    {
                        /* It has, so continue the same group */
                        loopFlag = 1u;
                        break;
                    }
                }
            }

            if (0u == loopFlag)
            {
                /* Updates the current group */
                Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
                /* Reset the widget group to initial state, no widgets in group */
                wdIdMask = 0u;
                maxDivider = 1u;
                maxSubconversions = 1u;
            }

            /* Process new slot with the widget group */
            for (j = 0u; j < CY_CAPSENSE_TOTAL_CH_NUMBER; j++)
            {
                if (wdIndex[j] < CY_CAPSENSE_SLOT_SHIELD_ONLY)
                {
                    /* Adds widget to a group */
                    wdIdMask |= 1uLL << wdIndex[j];
                    /* Stores max divider for a group */
                    if (maxDivider < ptrWdCfg[wdIndex[j]].ptrWdContext->snsClk)
                    {
                        maxDivider = ptrWdCfg[wdIndex[j]].ptrWdContext->snsClk;
                    }
                    /* Stores max number of sub-conversions for a group */
                    if (maxSubconversions < ptrWdCfg[wdIndex[j]].ptrWdContext->numSubConversions)
                    {
                        maxSubconversions = ptrWdCfg[wdIndex[j]].ptrWdContext->numSubConversions;
                    }
                }
            }
        }
        /* If no more slots, the current widget group still need to be updated */
        Cy_CapSense_SsAutoTuneScanDurationAlignment(wdIdMask, maxDivider, maxSubconversions, context);
    #endif /* (CY_CAPSENSE_TOTAL_CH_NUMBER > 1u) */

    /* Step #7: Assigning clock sources and restore project parameters */
    ptrWdCxt = context->ptrWdContext;
    for (i = 0u; i < ptrCommonCfg->numWd; i++)
    {
        /* Reverting back original customer's settings */
        ptrWdCxt->snsClkSource = (uint8_t)(((uint32_t)ptrWdCxt->snsClkSource >> CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_POS) &
                ~CY_CAPSENSE_CLK_SOURCE_SMARTSENSE_MASK);
        ptrWdCxt++;
    }

